// 1. Необходимо пользователя попросить ввести температуру в градусах Цельсия, 
// преобразовать введенное пользователем значение в соответствующую температуру в градусах по Фаренгейту
// и вывести в alert сообщение с текстом (пример): Цельсий: 21, Фаренгейт: 69.8

// 1.1
// const a = Number.parseFloat(prompt('Введите температуру в градусах Цельсия: '));

// const num = (9 / 5) * a + 32;

// alert(`Цельсий: ${a}, Фаренгейт: ${num.toFixed(1)}`);

// 1.2

// const a = Number.parseFloat(prompt('Введите температуру в градусах Цельсия: '));

// function faren() {
//     const num = (9 / 5) * a + 32;
//     return num.toFixed(1);
// }

// alert(`Цельсий: ${a}, Фаренгейт: ${faren()}`); // не разобрался как округлить вне функции.

